In [1]:
%matplotlib inline
import pandas as pd

In [4]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

FileNotFoundError: [Errno 2] No such file or directory: 'style-table.css'

In [2]:
df = pd.read_csv('titles.csv')
df.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [3]:
print(len(df.title))

244914

### What are the earliest two films listed in the titles dataframe?

In [4]:
df1 = df.sort_values(by='year')

In [5]:
print(df1.head(2))

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [6]:
df[df['title']=='Hamlet'].count()

title    20
year     20
dtype: int64

### How many movies are titled "North by Northwest"?

In [7]:
df[df['title']=='North by Northwest'].count()

title    1
year     1
dtype: int64

### When was the first movie titled "Hamlet" made?

In [8]:
df1[df1['title']=='Hamlet'].head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [9]:
list_ = df1[df1['title'] == "Treasure Island"].values.tolist()
df_TI = pd.DataFrame(data=list_,columns=['title','year'])
print(df_TI)

             title  year
0  Treasure Island  1918
1  Treasure Island  1920
2  Treasure Island  1934
3  Treasure Island  1950
4  Treasure Island  1972
5  Treasure Island  1973
6  Treasure Island  1985
7  Treasure Island  1999

### How many movies were made in the year 1950?

In [10]:
df_1950 = df[df['year']==1950]['year'].count()
print(df_1950)

1113

### How many movies were made in the year 1960?

In [11]:
df_1960 = df[df['year']==1960]['year'].count()
print(df_1960)

1549

### How many movies were made from 1950 through 1959?

In [12]:
df[(df['year'] >= 1950) & (df['year'] >= 1959)]['title'].count()

198514

### In what years has a movie titled "Batman" been released?

In [13]:
dfBT = df1[df1['title']=='Batman']['year'].tolist()
print('The movie "batman" is released in these years:')
print(f'\t {dfBT}')

The movie "batman" is released in these years:
	 [1943, 1989]

### How many roles were there in the movie "Inception"?

In [14]:
cast = pd.read_csv('/root/Downloads/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [15]:
cast[cast['title'] == 'Inception']['type'].count()

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [16]:
cast[cast['title'] == 'Inception']['n'].isna().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [17]:
cast[cast['title'] == 'Inception']['n'].notnull().sum()

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [18]:
cast_NN = cast[(cast['title']== 'North by Northwest') & (cast['n'].notnull())].sort_values(by = 'n')
cast_NN1 = pd.DataFrame(cast_NN[['name','n']].values , columns = ('Name','n'))
cast_NN1

                    Name   n
0             Cary Grant   1
1        Eva Marie Saint   2
2            James Mason   3
3    Jessie Royce Landis   4
4         Leo G. Carroll   5
5   Josephine Hutchinson   6
6            Philip Ober   7
7          Martin Landau   8
8          Adam Williams   9
9           Edward Platt  10
10     Robert Ellenstein  11
11          Les Tremayne  12
12       Philip Coolidge  13
13         Patrick McVey  14
14          Edward Binns  15
15             Ken Lynch  16

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [19]:
cast_S = cast[cast.n.notnull()].sort_values(by = 'n')
cast_S1 = cast_S.loc[(cast['title']=='Sleuth') & (cast['year'] == 1972)][['name','n']].reset_index(drop=True)
cast_S1

                 name    n
0    Laurence Olivier  1.0
1       Michael Caine  2.0
2      Alec Cawthorne  3.0
3  John (II) Matthews  4.0
4  Eve (III) Channing  5.0
5        Teddy Martin  6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [23]:
cast_S2007 =cast_S.loc[(cast_S['title'] == 'Sleuth') & (cast_S['year']== 2007)][['name','n']].reset_index(drop=True)
cast_S2007

            name    n
0  Michael Caine  1.0
1       Jude Law  2.0
2  Harold Pinter  3.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [24]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [27]:
cast[(cast['title']=='Hamlet') & (cast['year']==1921)]['character'].count()

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [28]:
cast[(cast['title']=='Hamlet') & (cast['year']==1996)]['character'].count()

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [31]:
cast[(cast['title']=='Hamlet')]['character'].count()

342

### How many people have played an "Ophelia"?

In [40]:
cast[(cast['character']=='Ophelia')]['name'].count()

117

### How many people have played a role called "The Dude"?

In [41]:
cast[(cast['character']=='The Dude')]['name'].count()

19

### How many people have played a role called "The Stranger"?

In [42]:
cast[(cast['character']=='The Stranger')]['name'].count()

212

### How many roles has Sidney Poitier played throughout his career?

In [43]:
cast[(cast['name']=='Sidney Poitier')]['character'].count()

43

### How many roles has Judi Dench played?

In [44]:
cast[(cast['name']=='Judi Dench')]['character'].count()

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [54]:
cast_CG = cast.loc[(cast['name'] == "Cary Grant") & (cast['n'] == 2) & (cast['year'] >= 1940)]
cast_cg = cast_CG.sort_values(by = 'year')[['character','year']]
cast_cg

          character  year
871423   Nick Arden  1940
871433  Roger Adams  1941

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [62]:
cast_CG = cast.loc[(cast['name'] == "Cary Grant") & (cast['n'] == 1) & (cast['year'] >= 1940) & (cast['year'] < 1950)]
cast_cg = cast_CG.sort_values(by = 'year')[['character','year']].values.tolist()
cast_cg1 = pd.DataFrame(cast_cg,columns= ['character','year']) 
cast_cg1

                               character  year
0                            Matt Howard  1940
1                           Walter Burns  1940
2                     C. K. Dexter Haven  1940
3                       Johnnie Aysgarth  1941
4                           Leopold Dilg  1942
5                  Patrick 'Pat' O'Toole  1942
6                          Capt. Cassidy  1943
7   Joe Adams -posing as Joe Bascopolous  1943
8                            Jerry Flynn  1944
9                      Mortimer Brewster  1944
10                            Ernie Mott  1944
11                           Cole Porter  1946
12                                Devlin  1946
13                           Dick Nugent  1947
14                                Dudley  1947
15                         Jim Blandings  1948
16                     Dr. Madison Brown  1948
17                 Captain Henri Rochard  1949

### How many roles were available for actors in the 1950s?

In [67]:
cast[(cast['type']== 'actor') & (cast['year'] >= 1950) & (cast['year'] < 1960)]['character'].count()

157738

### How many roles were available for actresses in the 1950s?

In [70]:
cast[(cast['type']== 'actress') & (cast['year'] >= 1950) & (cast['year'] < 1960)]['character'].count()

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [76]:
cast_n = cast.sort_values(by='year')
cast_n[(cast['n']==1) & (cast['year'] <= 1980)]['character'].count()

/root/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [77]:
cast_n = cast.sort_values(by='year')
cast_n[(cast['n']>1) & (cast['year'] <= 1980)]['character'].count()

/root/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

669320

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [78]:
cast[(cast['year'] >= 1894) & (cast['year'] <= 1980)]['n'].isnull().sum()

448347